Revit 2024 API
ParameterTypeId.EnergyAnalysisCreateAnalyticalModel Property
 "Create Energy Model"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisCreateAnalyticalModel As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisCreateAnalyticalModel {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace